backend/concurrency-test-run2.log

         /\      Grafana   /‾‾/  
    /\  /  \     |\  __   /  /   
   /  \/    \    | |/ /  /   ‾‾\ 
  /          \   |   (  |  (‾)  |
 / __________ \  |_|\_\  \_____/ 


     execution: local
        script: concurrency-test.js
        output: -

     scenarios: (100.00%) 1 scenario, 10 max VUs, 40s max duration (incl. graceful stop):
              * default: 10 looping VUs for 10s (gracefulStop: 30s)


running (01.0s), 10/10 VUs, 281 complete and 0 interrupted iterations
default   [  10% ] 10 VUs  01.0s/10s

running (02.0s), 10/10 VUs, 1008 complete and 0 interrupted iterations
default   [  20% ] 10 VUs  02.0s/10s

running (03.0s), 10/10 VUs, 1474 complete and 0 interrupted iterations
default   [  30% ] 10 VUs  03.0s/10s

running (04.0s), 10/10 VUs, 2724 complete and 0 interrupted iterations
default   [  40% ] 10 VUs  04.0s/10s

running (05.0s), 10/10 VUs, 3649 complete and 0 interrupted iterations
default   [  50% ] 10 VUs  05.0s/10s

running (06.0s), 10/10 VUs, 4316 complete and 0 interrupted iterations
default   [  60% ] 10 VUs  06.0s/10s

running (07.0s), 10/10 VUs, 5515 complete and 0 interrupted iterations
default   [  70% ] 10 VUs  07.0s/10s

running (08.0s), 10/10 VUs, 5772 complete and 0 interrupted iterations
default   [  80% ] 10 VUs  08.0s/10s

running (09.0s), 10/10 VUs, 6428 complete and 0 interrupted iterations
default   [  90% ] 10 VUs  09.0s/10s

running (10.0s), 10/10 VUs, 7368 complete and 0 interrupted iterations
default   [ 100% ] 10 VUs  10.0s/10s


  █ THRESHOLDS 

    http_req_failed
    ✓ 'rate<0.01' rate=0.00%


  █ TOTAL RESULTS 

    checks_total.......: 7416    738.400658/s
    checks_succeeded...: 100.00% 7416 out of 7416
    checks_failed......: 0.00%   0 out of 7416

    ✓ deposit status is 200

    HTTP
    http_req_duration..............: avg=13.35ms min=523µs    med=5.78ms max=556.75ms p(90)=29.71ms p(95)=49.12ms
      { expected_response:true }...: avg=13.35ms min=523µs    med=5.78ms max=556.75ms p(90)=29.71ms p(95)=49.12ms
    http_req_failed................: 0.00%  0 out of 7417
    http_reqs......................: 7417   738.500226/s

    EXECUTION
    iteration_duration.............: avg=13.47ms min=551.79µs med=5.89ms max=556.96ms p(90)=29.81ms p(95)=49.49ms
    iterations.....................: 7416   738.400658/s
    vus............................: 10     min=10        max=10
    vus_max........................: 10     min=10        max=10

    NETWORK
    data_received..................: 543 kB 54 kB/s
    data_sent......................: 1.1 MB 111 kB/s



running (10.0s), 00/10 VUs, 7416 complete and 0 interrupted iterations
default ✓ [ 100% ] 10 VUs  10s